'use strict';
let Tc= +prompt("Введите температуру по цельсию для перевода в фарингейты");
let Tf=(9/5)*Tc+32;
alert(("Температура по фарингейту= ")+(Tf.toFixed(1)));

let name;
let admin;
name= prompt("Введите имя для присвоения администратора например (Василий)");
admin=name;
alert(("Имя Администратора: ")+(name));

let result1= 10 + 10 + "10";
console.log(result1);
/*
1. 10 плюс 10 получаем 20
2. результат 20 приписываем значение 10 так как это строка а не число в итоге получаем 2010
3. с помощью console.log выводим result1 в консоль
 */
let result2=10 + "10" + 10;
console.log(result2);
/*
1. число 10 приписывается к строчной 10 следом еще 10, в итоге получается 101010
2. с помощью console.log выводим result2 в консоль
 */
let result3=10 + 10 + + "10";
console.log(result3);
/*
1. число 10 плюс 10 получаем 20
2. результат 20 плюс(унарный плюс) 10 получаем 30
3. с помощью console.log выводим result3 в консоль
 */
let result4=10 / -"";
console.log(result4);
/*
1. число 10 делим на  -"" отрицательную бесконечность (пустые ковычки это и есть 0);
2. с помощью console.log выводим result4 в консоль
 */
let result5=10 / +"2,5";
console.log(result5);
/*
1. число 10 делим на 2,5 ( перед строчным числлом стоит унарный плюс,
превращает строку в число, но так как число дробное и имеет запятую, а не точку(.)
число будет NaN. В JS дробные числа пишутся через точку(.) а не через (,)
2. результат деления NaN( так как число нельзя поделить на NaN)
3. с помощью console.log выводим result5 в консоль
 */
/*
let mode = "normal";
let my_valu3 = 102;
let 3my_value3 = "102"; ----> Ошибочная начинается с числа
let __hello__ = "world";
let $$$ = "money";
let !0_world = true;-----> Ошибочная начинается с ! знака
 */